Revit 2027 API
Material.ThermalAssetId Property
 The ElementId of the thermal PropertySetElement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId ThermalAssetId { get; set; }
Public Property ThermalAssetId As ElementId
	Get
	Set
public:
property ElementId^ ThermalAssetId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member ThermalAssetId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
Material Class
Autodesk.Revit.DB Namespace